-- Migration: Add initial promotion settings for OMON
INSERT INTO t_p29017774_avn_academy_training.instructor_promotion_settings (unit, points_config, ranks_flow)
VALUES (
    'ОМОН',
    $$[
      {
        "num": 1,
        "name": "Участие в ГМП",
        "desc": "3 и более фракций, включая ФСВНГ в т.ч отбитие ИК, похищения, теракты",
        "points": 100
      },
      {
        "num": 2,
        "name": "Участие в поставке",
        "points": 35
      },
      {
        "num": 3,
        "name": "Участие в отбитии налёта/ограбление",
        "points": 20,
        "bonusPoints": 15,
        "bonusLabel": "Успешное отбитие (+15 баллов)",
        "hasSubPoints": true
      },
      {
        "num": 4,
        "name": "Участие в отбитии КРАЗА",
        "desc": "Фотокарточку грузовика + фотокарточку доставления грузовика на титул гос. организаций",
        "points": 20,
        "bonusPoints": 15,
        "bonusLabel": "Успешная доставка (+15 баллов)",
        "hasSubPoints": true
      },
      {
        "num": 5,
        "name": "Участие в тренировке",
        "points": 15
      },
      {
        "num": 7,
        "name": "Мобильный патруль по территории Москвы 60 минут",
        "desc": "Минимум от 2-ух человек. Фотодоклады каждые 20 минут",
        "points": 30
      },
      {
        "num": 8,
        "name": "Штраф",
        "desc": "Фотокарточку оплаты штрафа",
        "points": 15
      },
      {
        "num": 9,
        "name": "Арест человек",
        "desc": "Фотокарточку посадки в тюрьму",
        "points": 20
      },
      {
        "num": 10,
        "name": "Групповой мобильный патруль по территории Москвы",
        "desc": "В составе от 3х человек, доклады каждые 20 минут",
        "points": 30
      },
      {
        "num": 11,
        "name": "Пост на территории ФСВНГ КПП или Вышки",
        "desc": "Фотодоклады каждые 20 минут",
        "points": 30
      },
      {
        "num": 12,
        "name": "Выездной групповой пост на особо важных объектах",
        "desc": "Группа мин. 3 чел. Объект-7, ВС, РЛС, МС, ЗМХ",
        "points": 20
      },
      {
        "num": 13,
        "name": "Пеший патруль по территории ФСВНГ 30 минут",
        "desc": "В составе от 2х человек, доклады каждые 10 минут",
        "points": 15
      },
      {
        "num": 14,
        "name": "Охрана собеседование",
        "desc": "Фотокарточку начала и конца собеседования",
        "points": 20
      },
      {
        "num": 15,
        "name": "Присутствие на вечерней поверке",
        "desc": "Фотокарточку начала и конца поверки",
        "points": 10
      },
      {
        "num": 16,
        "name": "Пост на территории ЦГБ-7",
        "desc": "Фотокарточку НАЧАЛО, СЕРЕДИНА, КОНЕЦ",
        "points": 25
      },
      {
        "num": 17,
        "name": "Помощь ВС РФ на призыве",
        "desc": "Фотокарточку НАЧАЛО, СЕРЕДИНА, КОНЕЦ со звания Старший сержант",
        "points": 25
      },
      {
        "num": 18,
        "name": "Принятие в подразделение",
        "points": 15
      },
      {
        "num": 19,
        "name": "Проведение экзамена",
        "points": 10
      },
      {
        "num": 20,
        "name": "Проверка рапорта на повышения",
        "points": 10
      },
      {
        "num": 21,
        "name": "Проведение тренировки",
        "points": 10
      },
      {
        "num": 22,
        "name": "Проведение практики задержание/стрельбы",
        "points": 10
      }
    ]$$::jsonb,
    $$[
      {
        "from": "Сержант",
        "to": "Старший Сержант",
        "points": 200,
        "mandatory": [
          { "num": 2, "name": "Участие в поставке", "count": 5 },
          { "num": 3, "name": "Участие в отбитии налёта/ограбление", "count": 1 },
          { "num": 22, "name": "Практика задержания и ареста", "count": 1 }
        ]
      },
      {
        "from": "Старший Сержант",
        "to": "Старшина",
        "points": 300,
        "mandatory": [
          { "num": 2, "name": "Участие в поставке", "count": 5 },
          { "num": 3, "name": "Участие в отбитии налёта/ограбление", "count": 3 },
          { "num": 13, "name": "Пеший патруль по территории ФСВНГ 30 минут", "count": 1 },
          { "num": 14, "name": "Охрана собеседование", "count": 1 },
          { "num": 22, "name": "Практика стрельбы", "count": 1 }
        ]
      },
      {
        "from": "Старшина",
        "to": "Прапорщик",
        "points": 500,
        "mandatory": [
          { "num": 2, "name": "Участие в поставке", "count": 8 },
          { "num": 3, "name": "Участие в отбитии налёта/ограбление", "count": 3 },
          { "num": 13, "name": "Пеший патруль по территории ФСВНГ 30 минут", "count": 1 },
          { "num": 7, "name": "Мобильный патруль по территории Москвы 60 минут", "count": 3 },
          { "num": 19, "name": "Экзамен (поставки/налеты)", "count": 1 }
        ]
      },
      {
        "from": "Прапорщик",
        "to": "Старший Прапорщик",
        "points": 600,
        "mandatory": [
          { "num": 2, "name": "Участие в поставке", "count": 10 },
          { "num": 3, "name": "Участие в отбитии налёта/ограбление", "count": 3 },
          { "num": 8, "name": "Штраф", "count": 3 }
        ]
      },
      {
        "from": "Старший Прапорщик",
        "to": "Младший Лейтенант",
        "points": 700,
        "mandatory": [
          { "num": 2, "name": "Участие в поставке", "count": 12 },
          { "num": 3, "name": "Участие в отбитии налёта/ограбление", "count": 5 },
          { "num": 8, "name": "Штраф", "count": 3 },
          { "num": 9, "name": "Арест человек", "count": 1 }
        ]
      },
      {
        "from": "Младший Лейтенант",
        "to": "Лейтенант",
        "points": 800,
        "mandatory": [
          { "num": 2, "name": "Участие в поставке", "count": 13 },
          { "num": 3, "name": "Участие в отбитии налёта/ограбление", "count": 5 },
          { "num": 8, "name": "Штраф", "count": 5 },
          { "num": 9, "name": "Арест человек", "count": 1 }
        ]
      },
      {
        "from": "Лейтенант",
        "to": "Старший Лейтенант",
        "points": 900,
        "mandatory": [
          { "num": 2, "name": "Участие в поставке", "count": 15 },
          { "num": 3, "name": "Участие в отбитии налёта/ограбление", "count": 6 },
          { "num": 8, "name": "Штраф", "count": 5 },
          { "num": 9, "name": "Арест человек", "count": 1 }
        ]
      },
      {
        "from": "Старший Лейтенант",
        "to": "Капитан",
        "points": 1200,
        "mandatory": [
          { "num": 2, "name": "Участие в поставке", "count": 15 },
          { "num": 3, "name": "Участие в отбитии налёта/ограбление", "count": 8 },
          { "num": 8, "name": "Штраф", "count": 10 },
          { "num": 9, "name": "Арест человек", "count": 1 }
        ]
      }
    ]$$::jsonb
)
ON CONFLICT (unit) 
DO UPDATE SET 
    points_config = EXCLUDED.points_config,
    ranks_flow = EXCLUDED.ranks_flow;
